src/cf/InformationRegisters/СтатьиЗатратПоНалогамВзносамСФОТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатьиЗатратПоНалогамВзносамСФОТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСтатьиЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхСтатейЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатратНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыДеятельностиДляНалоговогоУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДеятельностиДляНалоговогоУчетаЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяСистемаНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядокНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределяемыеЗатраты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыРасходовНУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыРасходовНУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизационнаяПремия</Name>
					<Comment>Амортизационная премия (п. 1.1 ст. 259 НК РФ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрендаФедеральногоИМуниципальногоИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеЛичноеСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандировочныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитываемыеВЦеляхНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НИОКР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НИОКРПоПеречнюПравительстваРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеИДобровольноеСтрахованиеИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвоениеПриродныхРесурсов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаРекламуНормируемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтОсновныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДополнительныхСтатейЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхСтатейЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС_НС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС_БЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СтатьиЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СтатьиЗатрат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДеятельностиДляНалоговогоУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасходовНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходовНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СтатьиЗатратПоНалогамВзносамСФОТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьСоответствияСтатейЗатратПоНалогамВзносамСФОТ() Экспорт
	
	СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Страховые взносы", Истина);						
	Если СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		Справочник_Менеджер = Справочники.СтатьиЗатрат;
		ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();				
		ЭлементСправочника.Наименование = "Страховые взносы";
		ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
		ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.СтраховыеВзносы; // См. Письмо ФНС от 7 апреля 2010 г. N 3-2-12/21
		ЭлементСправочника.Записать();
		СтатьяЗатратПоСтраховымВзносам = ЭлементСправочника.Ссылка;
	КонецЕсли;

	// Общее соответствие
	НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоНалогамВзносамСФОТ.СоздатьНаборЗаписей();
	НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы);
	НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(Справочники.СтатьиЗатрат.ПустаяСсылка());
	НаборЗаписейСоответствия.Прочитать();
	Если НаборЗаписейСоответствия.Количество() = 0 Тогда
		Запись = НаборЗаписейСоответствия.Добавить();
		Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
		Запись.СтатьяЗатратНачисления = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Запись.СтатьяЗатрат = СтатьяЗатратПоСтраховымВзносам;
		НаборЗаписейСоответствия.Записать();
	КонецЕсли;
	
	//Статья для основной стистемы налогообложения	
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТруда");	
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоНалогамВзносамСФОТ.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоСтраховымВзносам;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	//Статья для ЕНВД
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТрудаЕНВД");	
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Страховые взносы (ЕНВД)", Истина);						
		Если СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
			Справочник_Менеджер = Справочники.СтатьиЗатрат;
			ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();				
			ЭлементСправочника.Наименование = "Страховые взносы (ЕНВД)";
			ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения;
			ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.СтраховыеВзносы;
			ЭлементСправочника.Записать();
			СтатьяЗатратПоСтраховымВзносам = ЭлементСправочника.Ссылка;
		КонецЕсли;
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоНалогамВзносамСФОТ.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоСтраховымВзносам;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Общее соответствие
	СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Взносы в ФСС от НС и ПЗ", Истина);						
	Если СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		Справочник_Менеджер = Справочники.СтатьиЗатрат;
		ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();				
		ЭлементСправочника.Наименование = "Взносы в ФСС от НС и ПЗ";
		ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
		ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
		ЭлементСправочника.Записать();
		СтатьяЗатратПоФСС_НС = ЭлементСправочника.Ссылка;
	КонецЕсли;
	
	НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоНалогамВзносамСФОТ.СоздатьНаборЗаписей();
	НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС);
	НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(Справочники.СтатьиЗатрат.ПустаяСсылка());
	НаборЗаписейСоответствия.Прочитать();
	Если НаборЗаписейСоответствия.Количество() = 0 Тогда
		Запись = НаборЗаписейСоответствия.Добавить();
		Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
		Запись.СтатьяЗатратНачисления = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Запись.СтатьяЗатрат = СтатьяЗатратПоФСС_НС;
		НаборЗаписейСоответствия.Записать();
	КонецЕсли;
	
	//Статья для основной стистемы налогообложения	
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТруда");	
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоНалогамВзносамСФОТ.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоФСС_НС;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	//Статья для ЕНВД
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТрудаЕНВД");	
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Взносы в ФСС от НС и ПЗ (ЕНВД)", Истина);						
		Если СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
			Справочник_Менеджер = Справочники.СтатьиЗатрат;
			ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();				
			ЭлементСправочника.Наименование = "Взносы в ФСС от НС и ПЗ (ЕНВД)";
			ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения;
			ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
			ЭлементСправочника.Записать();
			СтатьяЗатратПоФСС_НС = ЭлементСправочника.Ссылка;
		КонецЕсли;
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоНалогамВзносамСФОТ.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоФСС_НС;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


// Функция получения предопределнного элемента по имени
// Используется для исключения влияния повторного использования в стандартном механизме
Функция ПредопределенныйЭлемент(ИмяПредопределенногоЭлемента)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 
	                |	Ссылка 
	                |ИЗ
	                |	Справочник.СтатьиЗатрат 
	                |ГДЕ
	                |	ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенногоЭлемента);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
	
	Иначе
		
		Возврат Результат.Выгрузить()[0].Ссылка;
	
	КонецЕсли; 

КонецФункции // ПредопределенныйЭлемент()
	
#КонецЕсли
